import React from 'react';

const Privacy = () => {
  return (
    <div>
      <div>
        <h5>
          {' '}
          개인정보취급방침 개드립 사이트(이하 개드립)는 회원의 개인정보를 중요시하며, "정보통신망 이용촉진 및
          정보보호"에 관한 법률을 준수하고 있습니다. "개드립"은 개인정보취급방침을 통하여 회원이 제공하는 개인정보가
          어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
          "개드립"은 개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별 공지)을 통하여 공지할 것입니다.
        </h5>
        <h3> 제1조 수집하는 개인정보 항목</h3>
        <div>
          {' '}
          "개드립"은 회원가입, 상담, 서비스 신청 등등을 위해 아래와 같은 개인정보를 수집하고 있습니다. 1. 회원 가입에서
          아래 정보가 수집됩니다. - 아이디, 비밀번호, 닉네임, 이메일, 전화번호 2. 사이트 내 접속 및 활동 시 아래 정보가
          자동으로 생성되어 수집될 수 있습니다. - 서비스 이용 기록, 접속 로그, 방문일시, 기기 정보, 쿠키, IP주소, 부정
          이용 기록
        </div>
        <h3> 제2조 개인정보의 수집 및 이용목적</h3>
        <div>
          {' '}
          "개드립"은 수집한 개인정보를 다음의 목적을 위해 활용합니다. 1. 서비스 제공에 관한 계약 이행 및 서비스 제공에
          따른 요금정산 콘텐츠 제공 2. 회원제 서비스 이용에 따른 본인 확인, 개인 식별, 불량회원의 부정 이용 방지와
          비인가 사용 방지, 가입 의사 확인, 각종 민원처리, 다중 계정 제한, 중복 가입 제한, 고지사항 전달 3. 마케팅 및
          광고에 활용, 신규 서비스 개발 및 특화, 이벤트 등 광고성 정보 전달, 인구통계학적 특성에 따른 서비스 제공 및
          광고 게재 4. 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계
        </div>
        <h3>제3조 개인정보의 보유 및 이용기간</h3>
        <div>
          {' '}
          "개드립"은 개인정보의 수집 및 이용목적이 달성된 후나 회원탈퇴와 같은 개인정보 수집 제공에 대한 동의 철회 시
          해당 정보를 파기하는 등 필요한 조치를 취합니다. 다만 내부 방침 및 관계법령에 따라 보관할 수 있으며, 구체적인
          개인정보의 보유 및 이용기간은 다음과 같습니다. 1. 불법적 사용자에 대한 관련 기관 수사 협조에 따라 개인정보가
          최대 3개월간 보관 후 파기됩니다. 2. 논란 및 부정한 이용자의 재가입이나 다중 가입을 방지를 위해 아래의 정보는
          보관됩니다. ① 게시글 및 댓글의 개인정보(닉네임 등)와 작성 내용은 영구 보관합니다. ② 접속 기록을 5년간 보관하며
          그 후 어떠한 용도로도 열람 또는 이용할 수 없도록 파기 처리합니다. ③ 개인정보 자체는 보관하지 않으나 개인정보의
          일부가 해시를 포함한 단방향 기술들로 복호화 불가능하게하여 영구 보관합니다. ④ 논란 및 부정한 이용자의 서비스
          이용 제한 조치 이력을 영구 보관합니다.
        </div>
      </div>
    </div>
  );
};

export default Privacy;
