import React from 'react';

const Agreement = () => {
  return (
    <div
      style={{
        width: '100%',
        height: '95%',
        overflowY: 'scroll',
      }}
    >
      <h3> 이용약관 제1조 목적</h3>
      <div>
        {' '}
        1. 개드립(www.dogdrip.net) 서비스 약관(이하 "본 약관"이라 합니다)은
        회원이 개드립에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 합니다)를
        이용함에 있어 회원과 "개드립"의 권리·의무 및 책임사항을 규정함을
        목적으로 합니다. 2. 회원이 되고자 하는 자가 "개드립"에서 정한 소정의
        절차를 거쳐서 "약관동의" 단추를 누르면 본 약관에 동의하는 것으로
        간주합니다. 본 약관에 정하는 이외의 회원과 "개드립"의 권리, 의무 및
        책임사항에 관해서는 전기통신사업법 기타 대한민국의 관련 법령과 상관습에
        의합니다.{' '}
      </div>
      <h3> 제2조 용어 정의</h3>
      <div>
        {' '}
        1. 회원: "개드립"에 접속하여 본 약관에 따라 "개드립" 회원으로 가입하여
        "개드립"에서 제공하는 서비스를 받는 자를 말합니다. 2. 기타 약관에서
        정하지 아니한 용어는 관계 법령 및 일반 관례에 따릅니다. 제3조 이용약관의
        효력 및 변경 1. 이 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그
        효력을 발생합니다. 2. 이 약관의 내용은 회원이 이에 동의하여 서비스에
        가입함으로써 효력이 발생합니다. 3. 약관에 대한 동의는 이용 신청시 화면
        상의 '회원 가입 약관' - '위의 내용을 모두 읽었으며 동의합니다.' 항목에
        체크를 함으로써 이루어지는 것으로 간주합니다.
      </div>
      <h3> 제2조 용어 정의</h3>
      <div>
        {' '}
        1. 회원: "개드립"에 접속하여 본 약관에 따라 "개드립" 회원으로 가입하여
        "개드립"에서 제공하는 서비스를 받는 자를 말합니다. 2. 기타 약관에서
        정하지 아니한 용어는 관계 법령 및 일반 관례에 따릅니다. 제3조 이용약관의
        효력 및 변경 1. 이 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그
        효력을 발생합니다. 2. 이 약관의 내용은 회원이 이에 동의하여 서비스에
        가입함으로써 효력이 발생합니다. 3. 약관에 대한 동의는 이용 신청시 화면
        상의 '회원 가입 약관' - '위의 내용을 모두 읽었으며 동의합니다.' 항목에
        체크를 함으로써 이루어지는 것으로 간주합니다.
      </div>
      <h3> 제2조 용어 정의</h3>
      <div>
        {' '}
        1. 회원: "개드립"에 접속하여 본 약관에 따라 "개드립" 회원으로 가입하여
        "개드립"에서 제공하는 서비스를 받는 자를 말합니다. 2. 기타 약관에서
        정하지 아니한 용어는 관계 법령 및 일반 관례에 따릅니다. 제3조 이용약관의
        효력 및 변경 1. 이 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그
        효력을 발생합니다. 2. 이 약관의 내용은 회원이 이에 동의하여 서비스에
        가입함으로써 효력이 발생합니다. 3. 약관에 대한 동의는 이용 신청시 화면
        상의 '회원 가입 약관' - '위의 내용을 모두 읽었으며 동의합니다.' 항목에
        체크를 함으로써 이루어지는 것으로 간주합니다.
      </div>
    </div>
  );
};

export default Agreement;
